c5/src/InformationRegisters/Jobs/Jobs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Jobs</name>
  <resources>
    <name>Error</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Status</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>JobKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/CommonModules/Progress/Module.bsl
&AtClient
Procedure Open ( JobKey, FormOwner = undefined, Notification = undefined, ShowStatus = false, ShowMessage = 0 ) export
	
	p = new Structure ();
	p.Insert ( "JobKey", JobKey );
	p.Insert ( "ShowStatus", ShowStatus );
	p.Insert ( "ShowMessage", ShowMessage );
	if ( FormOwner = undefined ) then
		mode = FormWindowOpeningMode.LockWholeInterface;
		if ( Notification = undefined ) then
			receiver = undefined;
		else
			module = Notification.Module;
			if ( TypeOf ( module ) = Type ( "ClientApplicationForm" ) ) then
				receiver = module.UUID;
			endif;
		endif;
	else
		mode = FormWindowOpeningMode.LockOwnerWindow;
		receiver = FormOwner.UUID; 
	endif;
	p.Insert ( "MessageReceiver", receiver );
	OpenForm ( "CommonForm.Progress", p, FormOwner, , , , Notification, mode );

EndProcedure 

&AtServer
Procedure Put ( Status, JobKey, Error = false ) export
	
	r = InformationRegisters.Jobs.CreateRecordManager ();
	r.JobKey = JobKey;
	r.Status = Status;
	r.Error = Error;
	r.Write ();
	
EndProcedure
